:PROPERTIES:
:ID:       18b6e880-37af-4276-ae0a-9f92f02d0412
:END:
#+TITLE: FRC: April Tags
#+CATEGORY: slips
#+TAGS:  
#+OPTIONS: html-style: nil

Notes from [[https://docs.wpilib.org/en/stable/docs/software/vision-processing/wpilibpi/walkthrough-video.html][FRC Vision with Raspberry Pi & Robot Simulation with WPILib]]

*** FRC uses =36h11=

Conversion from =Tag36h11= in its =TagFamily= constructor

+ one to one correspondence b/w the classic family and the =36= bits of signal
  space in a =2D= area. The Java longs referenced in the constructor convert into
  pixels
+ the coding system enforces a minimum distance of =11b= hamming distance between
  all codes.

#+begin_src java
public TagFamily(int area, int minimumHammingDistance, long codes[]) {
    this(LayoutUtil.getClassicLayout((int) Math.sqrt(area) + 4),
         minimumHammingDistance,
         upgradeCodes(codes, (int) Math.sqrt(area)));
}
#+end_src

Using python (just wondering)

#+begin_src python :results output verbatim
import sys

apr = [
    0xd5d628584,0xd97f18b49,0xdd280910e,0xe479e9c98,0xebcbca822,0xf31dab3ac,
    0x056a5d085,0x10652e1d4,0x22b1dfead,0x265ad0472,0x34fe91b86,0x3ff962cd5,
    0x43a25329a,0x474b4385f,0x4e9d243e9,0x5246149ae,0x5997f5538,0x683bb6c4c,
    0x6be4a7211,0x7e3158eea,0x81da494af,0x858339a74,0x8cd51a5fe,0x9f21cc2d7,
    0xa2cabc89c,0xadc58d9eb,0xb16e7dfb0,0xb8c05eb3a,0xd25ef139d,0xd607e1962,
    0xe4aba3076,0x2dde6a3da,0x43d40c678,0x5620be351,0x64c47fa65,0x686d7002a]

m = sys.maxsize
print(f'{m:63b}')
print(f'{apr[0]:63b}')
print(f'{apr[1]:63b}')
print(f'{(apr[0]^apr[1]):63b}')

print(f'{apr[2]:63b}')
print(f'{apr[3]:63b}')

print(f'{apr[4]:63b}')
print(f'{apr[5]:63b}')
print(f'{(apr[2]^apr[3]):63b}')
print(f'{(apr[4]^apr[5]):63b}')

x=(apr[0]^apr[1])
y=(apr[2]^apr[3])
z=(apr[4]^apr[5])
#+end_src


#+RESULTS:
#+begin_example
111111111111111111111111111111111111111111111111111111111111111
                           110101011101011000101000010110000100
                           110110010111111100011000101101001001
                               11001010100100110000111011001101
                           110111010010100000001001000100001110
                           111001000111100111101001110010011000
                           111010111100101111001010100000100010
                           111100110001110110101011001110101100
                             1110010101000111100000110110010110
                              110001101011001100001101110001110
#+end_example
